modm-ext/archive-stmicro-svd/header_stm32h753aii6.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>HRTIM1</name>
      <baseAddress>0x40017400</baseAddress>
      <registers>
        <register>
          <name>MCR</name>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CK_PSC</name>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>CONT</name>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RETRIG</name>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>HALF</name>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SYNC_IN</name>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>SYNCRSTM</name>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SYNCSTRTM</name>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SYNC_OUT</name>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>SYNC_SRC</name>
              <bitOffset>14</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>MCEN</name>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TACEN</name>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TBCEN</name>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TCCEN</name>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TDCEN</name>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TECEN</name>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DACSYNC</name>
              <bitOffset>25</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>PREEN</name>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MREPU</name>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BRSTDMA</name>
              <bitOffset>30</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>MISR</name>
          <addressOffset>0x4</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>MCMP1</name>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MCMP2</name>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MCMP3</name>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MCMP4</name>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MREP</name>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SYNC</name>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MUPD</name>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>MICR</name>
          <addressOffset>0x8</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>MCMP1</name>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MCMP2</name>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MCMP3</name>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MCMP4</name>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MREP</name>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SYNC</name>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MUPD</name>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>MDIER</name>
          <addressOffset>0xc</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>MCMP1IE</name>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MCMP2IE</name>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MCMP3IE</name>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MCMP4IE</name>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MREPIE</name>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SYNCIE</name>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MUPDIE</name>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MCMP1DE</name>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MCMP2DE</name>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MCMP3DE</name>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MCMP4DE</name>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MREPDE</name>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SYNCDE</name>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MUPDDE</name>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>MCNTR</name>
          <addressOffset>0x10</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>MCNTR</name>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>MPER</name>
          <addressOffset>0x14</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>MPER</name>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>MREP</name>
          <addressOffset>0x18</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>MREP</name>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>MCMP1R</name>
          <addressOffset>0x1c</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>MCMP4R</name>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>MCMP2R</name>
          <addressOffset>0x24</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>MCMP3R</name>
          <addressOffset>0x28</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>MCMP4R</name>
          <addressOffset>0x2c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>sTimerxRegs.0.TIMxCR</name>
          <addressOffset>0x80</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>sTimerxRegs.0.TIMxISR</name>
          <addressOffset>0x84</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>sTimerxRegs.0.TIMxICR</name>
          <addressOffset>0x88</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>sTimerxRegs.0.TIMxDIER</name>
          <addressOffset>0x8c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>sTimerxRegs.0.CNTxR</name>
          <addressOffset>0x90</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>sTimerxRegs.0.PERxR</name>
          <addressOffset>0x94</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>sTimerxRegs.0.REPxR</name>
          <addressOffset>0x98</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>sTimerxRegs.0.CMP1xR</name>
          <addressOffset>0x9c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>sTimerxRegs.0.CMP1CxR</name>
          <addressOffset>0xa0</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>sTimerxRegs.0.CMP2xR</name>
          <addressOffset>0xa4</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>sTimerxRegs.0.CMP3xR</name>
          <addressOffset>0xa8</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>sTimerxRegs.0.CMP4xR</name>
          <addressOffset>0xac</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>sTimerxRegs.0.CPT1xR</name>
          <addressOffset>0xb0</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>sTimerxRegs.0.CPT2xR</name>
          <addressOffset>0xb4</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>sTimerxRegs.0.DTxR</name>
          <addressOffset>0xb8</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>sTimerxRegs.0.SETx1R</name>
          <addressOffset>0xbc</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>sTimerxRegs.0.RSTx1R</name>
          <addressOffset>0xc0</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>sTimerxRegs.0.SETx2R</name>
          <addressOffset>0xc4</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>sTimerxRegs.0.RSTx2R</name>
          <addressOffset>0xc8</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>sTimerxRegs.0.EEFxR1</name>
          <addressOffset>0xcc</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>sTimerxRegs.0.EEFxR2</name>
          <addressOffset>0xd0</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>sTimerxRegs.0.RSTxR</name>
          <addressOffset>0xd4</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>sTimerxRegs.0.CHPxR</name>
          <addressOffset>0xd8</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>sTimerxRegs.0.CPT1xCR</name>
          <addressOffset>0xdc</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>sTimerxRegs.0.CPT2xCR</name>
          <addressOffset>0xe0</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>sTimerxRegs.0.OUTxR</name>
          <addressOffset>0xe4</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>sTimerxRegs.0.FLTxR</name>
          <addressOffset>0xe8</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>sTimerxRegs.1.TIMxCR</name>
          <addressOffset>0x100</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>sTimerxRegs.1.TIMxISR</name>
          <addressOffset>0x104</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>sTimerxRegs.1.TIMxICR</name>
          <addressOffset>0x108</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>sTimerxRegs.1.TIMxDIER</name>
          <addressOffset>0x10c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>sTimerxRegs.1.CNTxR</name>
          <addressOffset>0x110</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>sTimerxRegs.1.PERxR</name>
          <addressOffset>0x114</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>sTimerxRegs.1.REPxR</name>
          <addressOffset>0x118</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>sTimerxRegs.1.CMP1xR</name>
          <addressOffset>0x11c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>sTimerxRegs.1.CMP1CxR</name>
          <addressOffset>0x120</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>sTimerxRegs.1.CMP2xR</name>
          <addressOffset>0x124</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>sTimerxRegs.1.CMP3xR</name>
          <addressOffset>0x128</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>sTimerxRegs.1.CMP4xR</name>
          <addressOffset>0x12c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>sTimerxRegs.1.CPT1xR</name>
          <addressOffset>0x130</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>sTimerxRegs.1.CPT2xR</name>
          <addressOffset>0x134</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>sTimerxRegs.1.DTxR</name>
          <addressOffset>0x138</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>sTimerxRegs.1.SETx1R</name>
          <addressOffset>0x13c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>sTimerxRegs.1.RSTx1R</name>
          <addressOffset>0x140</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>sTimerxRegs.1.SETx2R</name>
          <addressOffset>0x144</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>sTimerxRegs.1.RSTx2R</name>
          <addressOffset>0x148</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>sTimerxRegs.1.EEFxR1</name>
          <addressOffset>0x14c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>sTimerxRegs.1.EEFxR2</name>
          <addressOffset>0x150</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>sTimerxRegs.1.RSTxR</name>
          <addressOffset>0x154</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>sTimerxRegs.1.CHPxR</name>
          <addressOffset>0x158</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>sTimerxRegs.1.CPT1xCR</name>
          <addressOffset>0x15c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>sTimerxRegs.1.CPT2xCR</name>
          <addressOffset>0x160</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>sTimerxRegs.1.OUTxR</name>
          <addressOffset>0x164</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>sTimerxRegs.1.FLTxR</name>
          <addressOffset>0x168</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>sTimerxRegs.2.TIMxCR</name>
          <addressOffset>0x180</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>sTimerxRegs.2.TIMxISR</name>
          <addressOffset>0x184</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>sTimerxRegs.2.TIMxICR</name>
          <addressOffset>0x188</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>sTimerxRegs.2.TIMxDIER</name>
          <addressOffset>0x18c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>sTimerxRegs.2.CNTxR</name>
          <addressOffset>0x190</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>sTimerxRegs.2.PERxR</name>
          <addressOffset>0x194</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>sTimerxRegs.2.REPxR</name>
          <addressOffset>0x198</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>sTimerxRegs.2.CMP1xR</name>
          <addressOffset>0x19c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>sTimerxRegs.2.CMP1CxR</name>
          <addressOffset>0x1a0</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>sTimerxRegs.2.CMP2xR</name>
          <addressOffset>0x1a4</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>sTimerxRegs.2.CMP3xR</name>
          <addressOffset>0x1a8</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>sTimerxRegs.2.CMP4xR</name>
          <addressOffset>0x1ac</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>sTimerxRegs.2.CPT1xR</name>
          <addressOffset>0x1b0</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>sTimerxRegs.2.CPT2xR</name>
          <addressOffset>0x1b4</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>sTimerxRegs.2.DTxR</name>
          <addressOffset>0x1b8</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>sTimerxRegs.2.SETx1R</name>
          <addressOffset>0x1bc</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>sTimerxRegs.2.RSTx1R</name>
          <addressOffset>0x1c0</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>sTimerxRegs.2.SETx2R</name>
          <addressOffset>0x1c4</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>sTimerxRegs.2.RSTx2R</name>
          <addressOffset>0x1c8</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>sTimerxRegs.2.EEFxR1</name>
          <addressOffset>0x1cc</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>sTimerxRegs.2.EEFxR2</name>
          <addressOffset>0x1d0</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>sTimerxRegs.2.RSTxR</name>
          <addressOffset>0x1d4</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>sTimerxRegs.2.CHPxR</name>
          <addressOffset>0x1d8</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>sTimerxRegs.2.CPT1xCR</name>
          <addressOffset>0x1dc</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>sTimerxRegs.2.CPT2xCR</name>
          <addressOffset>0x1e0</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>sTimerxRegs.2.OUTxR</name>
          <addressOffset>0x1e4</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>sTimerxRegs.2.FLTxR</name>
          <addressOffset>0x1e8</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>sTimerxRegs.3.TIMxCR</name>
          <addressOffset>0x200</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>sTimerxRegs.3.TIMxISR</name>
          <addressOffset>0x204</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>sTimerxRegs.3.TIMxICR</name>
          <addressOffset>0x208</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>sTimerxRegs.3.TIMxDIER</name>
          <addressOffset>0x20c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>sTimerxRegs.3.CNTxR</name>
          <addressOffset>0x210</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>sTimerxRegs.3.PERxR</name>
          <addressOffset>0x214</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>sTimerxRegs.3.REPxR</name>
          <addressOffset>0x218</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>sTimerxRegs.3.CMP1xR</name>
          <addressOffset>0x21c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>sTimerxRegs.3.CMP1CxR</name>
          <addressOffset>0x220</addressOffset>
          <size>0x20</size>
        </register>
