modm-ext/archive-stmicro-svd/header_stm32h753aii6.svd
        <register>
          <name>FGCLUT.63</name>
          <addressOffset>0x4fc</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>FGCLUT.64</name>
          <addressOffset>0x500</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>FGCLUT.65</name>
          <addressOffset>0x504</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>FGCLUT.66</name>
          <addressOffset>0x508</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>FGCLUT.67</name>
          <addressOffset>0x50c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>FGCLUT.68</name>
          <addressOffset>0x510</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>FGCLUT.69</name>
          <addressOffset>0x514</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>FGCLUT.70</name>
          <addressOffset>0x518</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>FGCLUT.71</name>
          <addressOffset>0x51c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>FGCLUT.72</name>
          <addressOffset>0x520</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>FGCLUT.73</name>
          <addressOffset>0x524</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>FGCLUT.74</name>
          <addressOffset>0x528</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>FGCLUT.75</name>
          <addressOffset>0x52c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>FGCLUT.76</name>
          <addressOffset>0x530</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>FGCLUT.77</name>
          <addressOffset>0x534</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>FGCLUT.78</name>
          <addressOffset>0x538</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>FGCLUT.79</name>
          <addressOffset>0x53c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>FGCLUT.80</name>
          <addressOffset>0x540</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>FGCLUT.81</name>
          <addressOffset>0x544</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>FGCLUT.82</name>
          <addressOffset>0x548</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>FGCLUT.83</name>
          <addressOffset>0x54c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>FGCLUT.84</name>
          <addressOffset>0x550</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>FGCLUT.85</name>
          <addressOffset>0x554</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>FGCLUT.86</name>
          <addressOffset>0x558</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>FGCLUT.87</name>
          <addressOffset>0x55c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>FGCLUT.88</name>
          <addressOffset>0x560</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>FGCLUT.89</name>
          <addressOffset>0x564</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>FGCLUT.90</name>
          <addressOffset>0x568</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>FGCLUT.91</name>
          <addressOffset>0x56c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>FGCLUT.92</name>
          <addressOffset>0x570</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>FGCLUT.93</name>
          <addressOffset>0x574</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>FGCLUT.94</name>
          <addressOffset>0x578</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>FGCLUT.95</name>
          <addressOffset>0x57c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>FGCLUT.96</name>
          <addressOffset>0x580</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>FGCLUT.97</name>
          <addressOffset>0x584</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>FGCLUT.98</name>
          <addressOffset>0x588</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>FGCLUT.99</name>
          <addressOffset>0x58c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>FGCLUT.100</name>
          <addressOffset>0x590</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>FGCLUT.101</name>
          <addressOffset>0x594</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>FGCLUT.102</name>
          <addressOffset>0x598</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>FGCLUT.103</name>
          <addressOffset>0x59c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>FGCLUT.104</name>
          <addressOffset>0x5a0</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>FGCLUT.105</name>
          <addressOffset>0x5a4</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>FGCLUT.106</name>
          <addressOffset>0x5a8</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>FGCLUT.107</name>
          <addressOffset>0x5ac</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>FGCLUT.108</name>
          <addressOffset>0x5b0</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>FGCLUT.109</name>
          <addressOffset>0x5b4</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>FGCLUT.110</name>
          <addressOffset>0x5b8</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>FGCLUT.111</name>
          <addressOffset>0x5bc</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>FGCLUT.112</name>
          <addressOffset>0x5c0</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>FGCLUT.113</name>
          <addressOffset>0x5c4</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>FGCLUT.114</name>
          <addressOffset>0x5c8</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>FGCLUT.115</name>
          <addressOffset>0x5cc</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>FGCLUT.116</name>
          <addressOffset>0x5d0</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>FGCLUT.117</name>
          <addressOffset>0x5d4</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>FGCLUT.118</name>
          <addressOffset>0x5d8</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>FGCLUT.119</name>
          <addressOffset>0x5dc</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>FGCLUT.120</name>
          <addressOffset>0x5e0</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>FGCLUT.121</name>
          <addressOffset>0x5e4</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>FGCLUT.122</name>
          <addressOffset>0x5e8</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>FGCLUT.123</name>
          <addressOffset>0x5ec</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>FGCLUT.124</name>
          <addressOffset>0x5f0</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>FGCLUT.125</name>
          <addressOffset>0x5f4</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>FGCLUT.126</name>
          <addressOffset>0x5f8</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>FGCLUT.127</name>
          <addressOffset>0x5fc</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>FGCLUT.128</name>
          <addressOffset>0x600</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>FGCLUT.129</name>
          <addressOffset>0x604</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>FGCLUT.130</name>
          <addressOffset>0x608</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>FGCLUT.131</name>
          <addressOffset>0x60c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>FGCLUT.132</name>
          <addressOffset>0x610</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>FGCLUT.133</name>
          <addressOffset>0x614</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>FGCLUT.134</name>
          <addressOffset>0x618</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>FGCLUT.135</name>
          <addressOffset>0x61c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>FGCLUT.136</name>
          <addressOffset>0x620</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>FGCLUT.137</name>
          <addressOffset>0x624</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>FGCLUT.138</name>
          <addressOffset>0x628</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>FGCLUT.139</name>
          <addressOffset>0x62c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>FGCLUT.140</name>
          <addressOffset>0x630</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>FGCLUT.141</name>
          <addressOffset>0x634</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>FGCLUT.142</name>
          <addressOffset>0x638</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>FGCLUT.143</name>
          <addressOffset>0x63c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>FGCLUT.144</name>
          <addressOffset>0x640</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>FGCLUT.145</name>
          <addressOffset>0x644</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>FGCLUT.146</name>
          <addressOffset>0x648</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>FGCLUT.147</name>
          <addressOffset>0x64c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>FGCLUT.148</name>
          <addressOffset>0x650</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>FGCLUT.149</name>
          <addressOffset>0x654</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>FGCLUT.150</name>
          <addressOffset>0x658</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>FGCLUT.151</name>
          <addressOffset>0x65c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>FGCLUT.152</name>
          <addressOffset>0x660</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>FGCLUT.153</name>
          <addressOffset>0x664</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>FGCLUT.154</name>
          <addressOffset>0x668</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>FGCLUT.155</name>
          <addressOffset>0x66c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>FGCLUT.156</name>
          <addressOffset>0x670</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>FGCLUT.157</name>
          <addressOffset>0x674</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>FGCLUT.158</name>
          <addressOffset>0x678</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>FGCLUT.159</name>
          <addressOffset>0x67c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>FGCLUT.160</name>
          <addressOffset>0x680</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>FGCLUT.161</name>
          <addressOffset>0x684</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>FGCLUT.162</name>
          <addressOffset>0x688</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>FGCLUT.163</name>
          <addressOffset>0x68c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>FGCLUT.164</name>
          <addressOffset>0x690</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>FGCLUT.165</name>
          <addressOffset>0x694</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>FGCLUT.166</name>
          <addressOffset>0x698</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>FGCLUT.167</name>
          <addressOffset>0x69c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>FGCLUT.168</name>
          <addressOffset>0x6a0</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>FGCLUT.169</name>
          <addressOffset>0x6a4</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>FGCLUT.170</name>
          <addressOffset>0x6a8</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>FGCLUT.171</name>
          <addressOffset>0x6ac</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>FGCLUT.172</name>
          <addressOffset>0x6b0</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>FGCLUT.173</name>
          <addressOffset>0x6b4</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>FGCLUT.174</name>
          <addressOffset>0x6b8</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>FGCLUT.175</name>
          <addressOffset>0x6bc</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>FGCLUT.176</name>
          <addressOffset>0x6c0</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>FGCLUT.177</name>
          <addressOffset>0x6c4</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>FGCLUT.178</name>
          <addressOffset>0x6c8</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>FGCLUT.179</name>
          <addressOffset>0x6cc</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>FGCLUT.180</name>
          <addressOffset>0x6d0</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>FGCLUT.181</name>
          <addressOffset>0x6d4</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>FGCLUT.182</name>
          <addressOffset>0x6d8</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>FGCLUT.183</name>
          <addressOffset>0x6dc</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>FGCLUT.184</name>
          <addressOffset>0x6e0</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>FGCLUT.185</name>
          <addressOffset>0x6e4</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>FGCLUT.186</name>
          <addressOffset>0x6e8</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>FGCLUT.187</name>
          <addressOffset>0x6ec</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>FGCLUT.188</name>
          <addressOffset>0x6f0</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>FGCLUT.189</name>
          <addressOffset>0x6f4</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>FGCLUT.190</name>
          <addressOffset>0x6f8</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>FGCLUT.191</name>
          <addressOffset>0x6fc</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>FGCLUT.192</name>
          <addressOffset>0x700</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>FGCLUT.193</name>
          <addressOffset>0x704</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>FGCLUT.194</name>
          <addressOffset>0x708</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>FGCLUT.195</name>
          <addressOffset>0x70c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>FGCLUT.196</name>
          <addressOffset>0x710</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>FGCLUT.197</name>
          <addressOffset>0x714</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>FGCLUT.198</name>
          <addressOffset>0x718</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>FGCLUT.199</name>
          <addressOffset>0x71c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>FGCLUT.200</name>
          <addressOffset>0x720</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>FGCLUT.201</name>
          <addressOffset>0x724</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>FGCLUT.202</name>
          <addressOffset>0x728</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>FGCLUT.203</name>
          <addressOffset>0x72c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>FGCLUT.204</name>
          <addressOffset>0x730</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>FGCLUT.205</name>
          <addressOffset>0x734</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>FGCLUT.206</name>
          <addressOffset>0x738</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>FGCLUT.207</name>
          <addressOffset>0x73c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>FGCLUT.208</name>
          <addressOffset>0x740</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>FGCLUT.209</name>
          <addressOffset>0x744</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>FGCLUT.210</name>
          <addressOffset>0x748</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>FGCLUT.211</name>
          <addressOffset>0x74c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>FGCLUT.212</name>
          <addressOffset>0x750</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>FGCLUT.213</name>
          <addressOffset>0x754</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>FGCLUT.214</name>
          <addressOffset>0x758</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>FGCLUT.215</name>
          <addressOffset>0x75c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>FGCLUT.216</name>
          <addressOffset>0x760</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>FGCLUT.217</name>
          <addressOffset>0x764</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>FGCLUT.218</name>
          <addressOffset>0x768</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>FGCLUT.219</name>
          <addressOffset>0x76c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>FGCLUT.220</name>
          <addressOffset>0x770</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>FGCLUT.221</name>
          <addressOffset>0x774</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>FGCLUT.222</name>
          <addressOffset>0x778</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>FGCLUT.223</name>
          <addressOffset>0x77c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>FGCLUT.224</name>
          <addressOffset>0x780</addressOffset>
          <size>0x20</size>
        </register>
